# Ultralytics YOLO11 object detection model

# Parameters
nc: 60
scales:
  x: [1.00, 1.00, 2048]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv3Backbone, ['dinov3_vitl16', [5, 11, 17, 23], "dinov3_main"]]
  
  - [0, 1, ViTMultiDepthAdapter, [384, 1024]] 

  - [1, 1, Split, [384, 0]]
  - [1, 1, Split, [384, 1]]
  - [1, 1, Split, [384, 2]]
  - [1, 1, Split, [384, 3]]

head:
  - [-1, 1, Conv, [384, 1, 1]]           
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 4], 1, Concat, [1]]           
  - [-1, 3, C3k2, [384, False]]         

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 3], 1, Concat, [1]]           
  - [-1, 3, C3k2, [384, False]]         

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 2], 1, Concat, [1]]           
  - [-1, 3, C3k2, [256, False]]     

  - [-1, 1, Conv, [256, 3, 2]]          
  - [[-1, 12], 1, Concat, [1]]          
  - [-1, 3, C3k2, [384, True]]          

  - [-1, 1, Conv, [384, 3, 2]]         
  - [[-1, 9], 1, Concat, [1]]        
  - [-1, 3, C3k2, [384, True]]      

  - [-1, 1, Conv, [384, 3, 2]]      
  - [[-1, 6], 1, Concat, [1]]          
  - [-1, 3, C3k2, [768, True]]       

  - [[15, 18, 21, 24], 1, Detect, [nc]] 

